
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt(`число от 1 до 59`);
// if(time <= 15){
//     console.log(' 1 чверть');
// } else if(time <= 30){
//
//     console.log('2 чверть');
// }else if(time <= 45){
//
//     console.log('3 чверть');
// } else if(time <= 59) {
//     console.log('4 чверть');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

// let time = +prompt(`число от 1 до 31`);
// if(time <= 10) {
//     console.log('первая');
// } else if(time <= 20){
//     console.log('вторая');
// }else if(time<= 31){
//     console.log('третья')
// }


// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = !true;
// console.log('Верно');

// let test = !!true;
// console.log('Не верно');


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('числа 1, 0, -3');
// if(a !==0)
// {
//     console.log('Правда')}
// else {
//     console.log('НЕ правда')
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається
// інфа що заплановано на цей день.

// let key ='Понедельник';
// switch (key){
//     case'Понедельник':
//         console.log('в принципе можно пострадать');
//         break;
//     case 'Вторник':
//         console.log('Ну, уже полегче');
//         break;
//     case 'Cреда':
//         console.log('Среда- маленькая пятница');
//         break;
//     case'Четверг':
//         console.log('Юху, скоро пятница');
//         break;
//     case'Пятница':
//         console.log('Пятница-развратница');
//         break;
//     case'Cуббота':
//         console.log('Выдыхаем после развратницы');
//         break;
//     case'Воскресенье':
//         console.log('Фу,завтра понедельник,подзравляю,выходные пролетели за 5 минут');
//         break;
//     default:
//         console.log('Вот ВАм и план на неделю');
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('сколько дней в году?');
// if (year % 2 === 0){
//     console.log('высокосный');
// }
// else{
//     console.log( 'ne высокосный');
// }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let a = prompt ('Яка офіційна назва JavaScript?');
if (a === 'ECMAScript'){
console.log('Правильно!')
} else{
    console.log('Не знаєте? ECMAScript!');
}

