// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let number1 = +prompt('число 1');
// let number2 = +prompt('число 2');
// if (number1<number2){
//     console.log('второе больше');
// }else if (number1>number2){
//     console.log('первое больше')
// }else (number1===number2)
// {
//     console.log('равны')
// }
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number= 10;
// if('number===10'){
//     console.log('verno');
// } else{
//     console.log('ne veno');
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 2;
// if (typeof x ==='number'){
//     console.log('1');
// } else if(typeof  x ==='strig'){
//     console.log('2');
// } else if(typeof x ==='boolean'){
//     console.log('3')
// } else if(typeof x==='object'){
//     console.log(4)
// }else{
//     document.write('шо это такое вообще');
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо  .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося

let temperature = +prompt('какая температура у тебя сегодня?')
  if(temperature >= 10 &&  temperature <= 22){
    console.log('ВЧИТИСЯ');
    alert('ВЧИТИСЯ');
  } else{
    console.log('ОНЛАЙН');
    alert('ВЧИТИСЯ')
  }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число
//     не вірне ...
let play = +prompt('введи число от 1 до 5');
  switch (play){
    case 1:
    alert('поздравляю,вы получите миллион');
    break;
    case 2:
      alert('поздравляю,вы получите меньше миллиона');
      break;
    case 3:
      alert('поздравляю,вы получите еще меньше миллиона');
      break;
    case 4:
      alert('поздравляю,не получите меньше миллиона)))');
      break;
    case 5:
      alert('поздравляю,вы не получите миллион, ничего не получсите)))');
      break;
    default:
          alert('Cударь, вы не счастливец')
  }