// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function rectg(a,b){
//     let x = a*b;
//     return x;
// }
// console.log(rectg(7,15));
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// function rectg(r){
//     let x = r**2;
//     let y = x * 3.14
//     return y;
// }
// console.log(rectg(56));
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function rectg(r, h) {
    let x = r ** 2;
    return x * Math.PI * h * 2;
}

console.log(rectg(5, 7));
// - створити функцію яка приймає масив та виводить кожен його елемент
//
//  let array= [1,2,3,4,5,6,7,]
// function arr(array){
//     for (i=0; i< array.length; i++);
//         console.log(array[i])
// }
// arr(array)

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент


// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

