// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому
// 3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if(friends >= 3  ){
//     console.log('big array');
//     alert('big boss');
// } else{
//     console.log('small array');
//     alert('mini');
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.




// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }


//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором


// let x = -100;
// if (typeof x ==='-100'){
//     console.log('1');
// } else if(typeof  x ===0){
//     console.log('2');
// } else if(typeof x ===100){
//     console.log('3')
// } else{
//     document.write('шо это такое вообще');
// }
let number = +prompt("число");
if (number >= -1 && number <= -100) {
    console.log('негатив')
} else if (number >= 1 && number <= 100) {
    console.log('позитив')
}
 else if (number === 0){
    console.log("ноль")
}
